{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "arguments": {}, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>M\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "function_type": "lambda", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "output_shape": null}}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "trainable": true, "cropping": [[65, 25], [0, 0]]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "b_regularizer": null, "activation": "relu", "nb_col": 5, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "bias": true, "nb_row": 5, "border_mode": "valid", "trainable": true, "nb_filter": 24, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "b_regularizer": null, "activation": "relu", "nb_col": 5, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "bias": true, "nb_row": 5, "border_mode": "valid", "trainable": true, "nb_filter": 36, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "b_regularizer": null, "activation": "relu", "nb_col": 5, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "bias": true, "nb_row": 5, "border_mode": "valid", "trainable": true, "nb_filter": 48, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "b_regularizer": null, "activation": "relu", "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "subsample": [1, 1], "bias": true, "nb_row": 3, "border_mode": "valid", "trainable": true, "nb_filter": 64, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "b_regularizer": null, "activation": "relu", "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "subsample": [1, 1], "bias": true, "nb_row": 3, "border_mode": "valid", "trainable": true, "nb_filter": 64, "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dim": 4224, "output_dim": 100, "bias": true, "name": "dense_1", "trainable": true, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dim": 100, "output_dim": 50, "bias": true, "name": "dense_2", "trainable": true, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dim": 50, "output_dim": 10, "bias": true, "name": "dense_3", "trainable": true, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dim": 10, "output_dim": 1, "bias": true, "name": "dense_4", "trainable": true, "W_constraint": null, "init": "glorot_uniform"}}]}